In [1]:
import pandas as pd
import numpy as np
import os
os.chdir(r'C:\Rohit\')

In [30]:
df = pd.read_excel('Adult_Child_Mapping.xlsx')
df

  person   type
0     A1  Adult
1     A2  Adult
2     A3  Adult
3     A4  Adult
4     A5  Adult
5     C1  Child
6     C2  Child
7     C3  Child
8     C4  Child

In [31]:
## Step 1: Create 2 separate dataframes for Adult and Child
# Adult
df_adult = df[df['type']=='Adult']
df_adult = df_adult[['person']]

# Child
df_child = df[df.type=='Child']
df_child = df_child[['person']]

In [32]:
df_child

  person
5     C1
6     C2
7     C3
8     C4

In [33]:
# Step 2: Create a key column in adult view
df_adult['rn_adult'] = df_adult['person'].rank(method='min')
df_adult

  person  rn_adult
0     A1       1.0
1     A2       2.0
2     A3       3.0
3     A4       4.0
4     A5       5.0

In [34]:
# Step 3: Create a key column in child view
df_child['rn_child'] = df_child['person'].rank(method='min')
df_child

  person  rn_child
5     C1       1.0
6     C2       2.0
7     C3       3.0
8     C4       4.0

In [35]:
# Step 4: Join the tables based on created key columns
df_final = df_adult.merge(df_child, how='left', left_on='rn_adult', right_on='rn_child')

In [36]:
# Step 5: Select only required columns
df_final = df_final[['person_x','person_y']].fillna('')
df_final

  person_x person_y
0       A1       C1
1       A2       C2
2       A3       C3
3       A4       C4
4       A5